akel/tutorial-cases/pipeCyclic/0/cellDist
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      cellDist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    side1
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
400
(
0
0
0
0
0
0
0
0
...
)
;
    }
    side2
    {
        type            cyclicAMI;
        value           nonuniform List<scalar> 
250
(
0
0
0
0
0
0
0
0
...
)
;
    }
    walls
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
